Revit 2027 API
GenericZone.GetBoundaries Method
 Gets the boundaries for the generic zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CurveLoop> GetBoundaries()
Public Function GetBoundaries As IList(Of CurveLoop)
public:
IList<CurveLoop^>^ GetBoundaries()
member GetBoundaries : unit -> IList<CurveLoop>
Return Value
IList<CurveLoop>
 The generic zone boundaries.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace